package io.github.eduardromanyuk.turbosms.model.response;

import java.util.StringJoiner;

public enum TsResponseStatus {
    OK(0, "Запрос обработан успешно."),
    PONG(1, "Успешный результат вызова метода ping."),
    REQUIRED_TOKEN(103, "Отсутствует токен аутентификации."),
    REQUIRED_CONTENT(104, "Отсутствуют данные запроса."),
    REQUIRED_AUTH(105, "Аутентификация не пройдена, не верный токен."),
    REQUIRED_ACTIVE_USER(106, "Пользователь заблокирован, работа с API невозможна до разблокировки."),
    REQUIRED_MESSAGE_SENDER(200, "Отсутствует или пустой параметр отправителя сообщения."),
    REQUIRED_MESSAGE_TEXT(201, "Отсутствует или пустой параметр текста сообщения."),
    REQUIRED_MESSAGE_RECIPIENT(202, "Отсутствует или пустой список получателей сообщения."),
    REQUIRED_BALANCE(203, "Не достаточно кредитов на балансе для создания рассылки."),
    REQUIRED_MESSAGE_BUTTON(204, "Отсутствуют или пустые параметры кнопки в сообщении, когда она обязательна."),
    REQUIRED_MESSAGE_BUTTON_CAPTION(205, "Отсутствует или пустой параметр текста на кнопке в сообщении."),
    REQUIRED_MESSAGE_BUTTON_ACTION(206, "Отсутствует или пустой параметр URL адреса, куда перейдёт получатель сообщения при нажатии на кнопку."),
    INVALID_REQUEST(300, "Неверный запрос, проверьте его структуру и корректность данных."),
    INVALID_TOKEN(301, "Неверный токен аутентификации."),
    INVALID_MESSAGE_SENDER(302, "Неверный отправитель сообщения."),
    INVALID_START_TIME(303, "Неверная дата отложенной отправки сообщения."),
    INVALID_MESSAGE_TEXT(304, "Недопустимое значение текста сообщения. Возвращается если передано не строковое значение или кодировка символов не входит в набор UTF-8."),
    INVALID_PHONE(305, "Недопустимый номер получателя, система не смогла распознать страну и оператора получателя."),
    INVALID_TTL(306, "Недопустимое значение параметра ttl, значение должно быть целочисленным и не представлено в виде строки."),
    INVALID_MESSAGE_ID(307, "Недопустимое значение параметра message_id, неверный формат."),
    INVALID_FILE_ID(308, "Недопустимое значение параметра id при вызове метода file/details, неверный формат."),
    NOT_ALLOWED_MESSAGE_SENDER(400, "Не разрешённый отправитель для текущего пользователя."),
    NOT_ALLOWED_MESSAGE_SENDER_NOT_ACTIVE(401, "Отправитель разрешён, но не активирован на данный момент (не оплачено использование в текущем месяце, не завершена регистрация и т.п.)."),
    NOT_ALLOWED_MESSAGE_IMAGE(402, "Недопустимый тип файла изображения."),
    NOT_ALLOWED_START_TIME(403, "Недопустимая дата отложенной отправки сообщения (выходит за пределы установленных ограничений)."),
    NOT_ALLOWED_NUMBER_STOPLIST(404, "Номер получателя находится в стоплисте (для sms) или в игнорлисте (для Viber), отправка невозможна."),
    NOT_ALLOWED_RECIPIENTS_LIMIT(405, "Недопустимое количество получателей."),
    NOT_ALLOWED_RECIPIENT_COUNTRY(406, "Недопустимая страна получателя. У пользователя не активирована возможность отправлять сообщения получателям данной страны. Для активации такой возможности свяжитесь с нашим отделом поддержки клиентов."),
    NOT_ALLOWED_RECIPIENT_DUPLICATE(407, "Получатель уже присутствует в рассылке, дубликаты игнорируются."),
    NOT_ALLOWED_MESSAGE_BUTTON_TEXT_LENGTH(408, "Текст на кнопке слишком длинный, допускается не более 30 символов."),
    NOT_ALLOWED_MESSAGE_TTL(409, "Недопустимое значение параметра ttl (выходит за пределы установленных ограничений)."),
    NOT_ALLOWED_MESSAGE_TRANSACTION_CONTENT(410, "Недопустимый контент в транзакционном сообщении. В таких сообщениях можно отправлять только текст, а кнопка и изображения запрещены."),
    NOT_ALLOWED_MESSAGE_DATA(411, "Какой-то из параметров имеет недопустимое значение, свяжитесь с нашим отделом поддержки клиентов для выяснения деталей."),
    NOT_ALLOWED_MESSAGE_TEXT(412, "Текст содержит запрещённые фрагменты."),
    NOT_ALLOWED_MESSAGE_TEXT_LENGTH(413, "Превышена допустимая длина текста сообщения."),
    NOT_ALLOWED_MESSAGE_ID(414, "Данные сообщения с переданным message_id недоступны для текущего пользователя."),
    NOT_ALLOWED_MESSAGE_TRANSACTION_SENDER(415, "Запрещено отправлять транзакционные сообщения от общего отправителя."),
    NOT_ALLOWED_MESSAGE_TRANSACTION_PATTERN(416, "Не найден шаблон, соответствующий переданному транзакционному сообщению."),
    NOT_ALLOWED_FILE_ID(417, "Файл с переданным id не существует или недоступен для текущего пользователя."),
    NOT_ALLOWED_FILE_EMPTY(418, "Указанный загружаемый файл не найден или пустой."),
    NOT_ALLOWED_FILE_TYPE(419, "Неподддерживаемый тип файла."),
    NOT_ALLOWED_FILE_SIZE(420, "Размер файла превышает максимально допустимый размер 3Мб."),
    FAILED_CONVERT_RESULT2JSON(500, "Не удалось сконвертировать данные результата в JSON формат, незамедлительно свяжитесь с нашим отделом поддержки клиентов для выяснения деталей."),
    FAILED_CONVERT_RESULT2XML(501, "Не удалось сконвертировать данные результата в XML формат, незамедлительно свяжитесь с нашим отделом поддержки клиентов для выяснения деталей."),
    FAILED_PARSE_BODY(502, "Не удалось распознать тело запроса (неверный формат)."),
    FAILED_SMS_SEND(503, "Не удалось отправить SMS сообщение."),
    FAILED_VIBER_SEND(504, "Не удалось отправить Viber сообщение."),
    FAILED_SAVE_IMAGE(505, "Не удалось сохранить изображение."),
    FAILED_SAVE_FILE(505, "Не удалось сохранить файл."),
    SUCCESS_MESSAGE_ACCEPTED(800, "Сообщения успешно созданы и добавлены в очередь отправки. Некоторые сообщения могут попадать на предварительную модерацию."),
    SUCCESS_MESSAGE_SENT(801, "Сообщения успешно отправлены."),
    SUCCESS_MESSAGE_PARTIAL_ACCEPTED(802, "Сообщения успешно созданы и добавлены в очередь отправки, но некоторые получатели не попали в список рассылки, детали смотрите в ответе."),
    SUCCESS_MESSAGE_PARTIAL_SENT(803, "Сообщения успешно отправлены, но некоторые получатели не попали в список рассылки, детали смотрите в ответе."),
    FATAL_ERROR(999, "Ошибка выполнения запроса, свяжитесь с отделом поддержки для выяснения деталей.");
    private final int code;
    private final String description;

    TsResponseStatus(int code, String description) {
        this.code = code;
        this.description = description;
    }

    public int code() {
        return this.code;
    }

    public String description() {
        return this.description;
    }

    @Override
    public String toString() {
        return new StringJoiner(" ")
                .add(String.valueOf(code))
                .add(this.name())
                .add(description)
                .toString();
    }
}
